web/src/test/resources/integrationtests/registertsdiabetes/requests.stg

delimiters "$", "$"

request(intygId, personId) ::= <<
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:riv:itintegration:registry:1" xmlns:urn1="urn:local:se:intygstjanster:services:RegisterTSDiabetesResponder:1" xmlns:urn2="urn:local:se:intygstjanster:services:1" xmlns:urn3="urn:local:se:intygstjanster:services:types:1">
   <soapenv:Header>
      <urn:LogicalAddress>?</urn:LogicalAddress>
   </soapenv:Header>
   <soapenv:Body>
      <urn1:RegisterTSDiabetes xmlns:urn3="urn:local:se:intygstjanster:services:types:1" xmlns:urn2="urn:local:se:intygstjanster:services:1" xmlns:urn1="urn:local:se:intygstjanster:services:RegisterTSDiabetesResponder:1">
         <urn1:intyg>
            <urn2:intygsId>$intygId$</urn2:intygsId>
            <urn2:intygsTyp>ts-diabetes</urn2:intygsTyp>
            <urn2:version>02</urn2:version>
            <urn2:utgava>06</urn2:utgava>
            <urn2:grundData>
               <urn2:signeringsTidstampel>2013-08-12T15:57:00</urn2:signeringsTidstampel>
               <urn2:skapadAv>
                  <urn2:personId>
                     <urn3:root>1.2.752.129.2.1.4.1</urn3:root>
                     <urn3:extension>SE0000000000-1333</urn3:extension>
                  </urn2:personId>
                  <urn2:fullstandigtNamn>Doktor Thompson</urn2:fullstandigtNamn>
                  <urn2:vardenhet>
                     <urn2:enhetsId>
                        <urn3:root>1.2.752.129.2.1.4.1</urn3:root>
                        <urn3:extension>SE0000000000-1337</urn3:extension>
                     </urn2:enhetsId>
                     <urn2:enhetsnamn>Vårdenhet Väst</urn2:enhetsnamn>
                     <urn2:postadress>Enhetsvägen 12</urn2:postadress>
                     <urn2:postnummer>54321</urn2:postnummer>
                     <urn2:postort>Tumba</urn2:postort>
                     <urn2:telefonnummer>08-1337</urn2:telefonnummer>
                     <urn2:vardgivare>
                        <urn2:vardgivarid>
                           <urn3:root>1.2.752.129.2.1.4.1</urn3:root>
                           <urn3:extension>SE0000000000-HAHAHHSAA</urn3:extension>
                        </urn2:vardgivarid>
                        <urn2:vardgivarnamn>Vårdgivarnamn</urn2:vardgivarnamn>
                     </urn2:vardgivare>
                  </urn2:vardenhet>
               </urn2:skapadAv>
               <urn2:patient>
                  <urn2:personId>
                     <urn3:root>1.2.752.129.2.1.3.1</urn3:root>
                     <urn3:extension>$personId$</urn3:extension>
                  </urn2:personId>
                  <urn2:fullstandigtNamn>Herr Dundersjuk</urn2:fullstandigtNamn>
                  <urn2:fornamn>Herr</urn2:fornamn>
                  <urn2:efternamn>Dundersjuk</urn2:efternamn>
                  <urn2:postadress>Testvägen 12</urn2:postadress>
                  <urn2:postnummer>12345</urn2:postnummer>
                  <urn2:postort>Testort</urn2:postort>
               </urn2:patient>
            </urn2:grundData>
            <urn2:intygAvser>
               <urn2:korkortstyp>AM</urn2:korkortstyp>
               <urn2:korkortstyp>A1</urn2:korkortstyp>
               <urn2:korkortstyp>A2</urn2:korkortstyp>
               <urn2:korkortstyp>A</urn2:korkortstyp>
               <urn2:korkortstyp>B</urn2:korkortstyp>
               <urn2:korkortstyp>BE</urn2:korkortstyp>
               <urn2:korkortstyp>TRAKTOR</urn2:korkortstyp>
               <urn2:korkortstyp>C1</urn2:korkortstyp>
               <urn2:korkortstyp>C1E</urn2:korkortstyp>
               <urn2:korkortstyp>C</urn2:korkortstyp>
               <urn2:korkortstyp>CE</urn2:korkortstyp>
               <urn2:korkortstyp>D1</urn2:korkortstyp>
               <urn2:korkortstyp>D1E</urn2:korkortstyp>
               <urn2:korkortstyp>D</urn2:korkortstyp>
               <urn2:korkortstyp>DE</urn2:korkortstyp>
               <urn2:korkortstyp>TAXI</urn2:korkortstyp>
            </urn2:intygAvser>
            <urn2:identitetStyrkt>
               <urn2:idkontroll>IDK6</urn2:idkontroll>
            </urn2:identitetStyrkt>
            <urn2:diabetes>
               <urn2:debutArDiabetes>2012</urn2:debutArDiabetes>
               <urn2:diabetesTyp>TYP2</urn2:diabetesTyp>
               <urn2:harBehandlingKost>true</urn2:harBehandlingKost>
               <urn2:harBehandlingTabletter>true</urn2:harBehandlingTabletter>
               <urn2:harBehandlingInsulin>true</urn2:harBehandlingInsulin>
               <urn2:insulinBehandlingSedanAr>2012</urn2:insulinBehandlingSedanAr>
               <urn2:annanBehandlingBeskrivning>Hypnos</urn2:annanBehandlingBeskrivning>
            </urn2:diabetes>
            <urn2:hypoglykemier>
               <urn2:harKunskapOmAtgarder>true</urn2:harKunskapOmAtgarder>
               <urn2:harTeckenNedsattHjarnfunktion>true</urn2:harTeckenNedsattHjarnfunktion>
               <urn2:saknarFormagaKannaVarningstecken>true</urn2:saknarFormagaKannaVarningstecken>
               <urn2:harAllvarligForekomst>true</urn2:harAllvarligForekomst>
               <urn2:allvarligForekomstBeskrivning>Beskrivning</urn2:allvarligForekomstBeskrivning>
               <urn2:harAllvarligForekomstTrafiken>true</urn2:harAllvarligForekomstTrafiken>
               <urn2:allvarligForekomstTrafikBeskrivning>Beskrivning</urn2:allvarligForekomstTrafikBeskrivning>
               <urn2:genomforEgenkontrollBlodsocker>true</urn2:genomforEgenkontrollBlodsocker>
               <urn2:harAllvarligForekomstVakenTid>true</urn2:harAllvarligForekomstVakenTid>
               <urn2:allvarligForekomstVakenTidAr>2012-12-12</urn2:allvarligForekomstVakenTidAr>
            </urn2:hypoglykemier>
            <urn2:separatOgonLakarintygKommerSkickas>false</urn2:separatOgonLakarintygKommerSkickas>
            <urn2:synfunktion>
               <urn2:harSynfaltsdefekt>false</urn2:harSynfaltsdefekt>
               <urn2:synskarpaUtanKorrektion>
                  <urn2:hogerOga>0.0</urn2:hogerOga>
                  <urn2:vansterOga>0.0</urn2:vansterOga>
                  <urn2:binokulart>0.0</urn2:binokulart>
               </urn2:synskarpaUtanKorrektion>
               <urn2:synskarpaMedKorrektion>
                  <urn2:hogerOga>0.0</urn2:hogerOga>
                  <urn2:vansterOga>0.0</urn2:vansterOga>
                  <urn2:binokulart>0.0</urn2:binokulart>
               </urn2:synskarpaMedKorrektion>
               <urn2:harDiplopi>true</urn2:harDiplopi>
               <urn2:finnsSynfaltsprovning>true</urn2:finnsSynfaltsprovning>
               <urn2:synfaltsprovningUtanAnmarkning>true</urn2:synfaltsprovningUtanAnmarkning>
               <urn2:finnsProvningOgatsRorlighet>true</urn2:finnsProvningOgatsRorlighet>
            </urn2:synfunktion>
            <urn2:ovrigKommentar>Kommentarer av det viktiga slaget</urn2:ovrigKommentar>
            <urn2:bedomning>
               <urn2:korkortstyp>AM</urn2:korkortstyp>
               <urn2:korkortstyp>A1</urn2:korkortstyp>
               <urn2:korkortstyp>A2</urn2:korkortstyp>
               <urn2:korkortstyp>A</urn2:korkortstyp>
               <urn2:korkortstyp>B</urn2:korkortstyp>
               <urn2:korkortstyp>BE</urn2:korkortstyp>
               <urn2:korkortstyp>TRAKTOR</urn2:korkortstyp>
               <urn2:korkortstyp>C1</urn2:korkortstyp>
               <urn2:korkortstyp>C1E</urn2:korkortstyp>
               <urn2:korkortstyp>C</urn2:korkortstyp>
               <urn2:korkortstyp>CE</urn2:korkortstyp>
               <urn2:korkortstyp>D1</urn2:korkortstyp>
               <urn2:korkortstyp>D1E</urn2:korkortstyp>
               <urn2:korkortstyp>D</urn2:korkortstyp>
               <urn2:korkortstyp>DE</urn2:korkortstyp>
               <urn2:korkortstyp>TAXI</urn2:korkortstyp>
               <urn2:lamplighetInnehaBehorighetSpecial>true</urn2:lamplighetInnehaBehorighetSpecial>
               <urn2:behovAvLakareSpecialistKompetens>Kronologisk bastuberedning</urn2:behovAvLakareSpecialistKompetens>
            </urn2:bedomning>
         </urn1:intyg>
      </urn1:RegisterTSDiabetes>
   </soapenv:Body>
</soapenv:Envelope>
>>
